** 42

   #+begin_src cpp
     #include <vector>
     #include <iostream>
     #include <numeric>

     using namespace std;

     int func (vector<int> &v) {
       int s = v.size();
       vector<int> dp(s-1);
       dp[0] = v[0];
       for (int i = 1; i < s-1; ++i)
         dp[i] = max(v[i], dp[i-1]);
       int m = v[s-1];
       int c = dp[s-2] - m;
       for (int i = s-3; i >= 0; --i) {
         m = min(v[i+1], m);
         int tmp = dp[i]-m;
         if (tmp > c)
           c = tmp;
       }
       return c;
     }

     int main() {
       vector<int> a {2, 4, 1, 16, 7, 5, 11, 9};
       cout << func(a);
       return 0;
     }
   #+end_src

   #+RESULTS:
   : 11

